package constance;

public enum VegetableEnum {
	胡萝卜("001","胡萝卜","胡萝卜，又称甘荀","胡萝卜营养价值丰富，包含多种胡萝卜素、维生素及微量元素等，因此被称作“平民人参”。","胡萝卜的提取物能够有效地预防肠道功能紊乱，对预防腹泻和腹痛有确切作用。","营养价值丰富，包含多种维生素"),
	茄子("002","茄子","茄子，又称六蔬，矮瓜","既可炒、烧、蒸、煮，也可油炸、凉 拌、做汤，都能烹调出美味可口的菜肴。","茄子含有维生素E，有防止出血和抗衰老功能，常吃茄子，对延缓人体衰老具有积极的意义。","有防止出血和抗衰老功能"),
	萝卜("003","萝卜","萝卜，又称莱菔","原产我国，品种极多，具有多种药用价值。","抗菌，抗病毒，抗肿瘤，有一定的抗辐射作用。","抗菌，抗病毒，抗肿瘤，抗辐射"),
	南瓜("004","南瓜","南瓜，又名麦瓜，金瓜等","嫩果味甘适口，是夏秋季节的瓜菜之一。可以做成可爱的南瓜甜饼。南瓜子可以做零食。","对提高机体的免疫力，维持正常视觉，促进骨骼的发育具有重要生理功能。","能提高免疫力，促进骨骼的发育"),
	番茄("005","番茄","番茄，俗称西红柿","番茄是全世界栽培最为普遍的果菜之一，栽培面积仍在继续扩大。","人们称番茄为“爱情果”，还因为此果真有如爱情一般的功效，可以让女孩子们更加美丽呢！","可以让你变得更加美丽"),
	黄瓜("006","黄瓜","黄瓜，又称胡瓜、青瓜","肉质脆嫩、汁多味甘、芳香可口。","黄瓜中的黄瓜酶，有很强的生物活性，能有效地促进机体的新陈代谢。用黄瓜捣汁涂擦皮肤，有润肤，舒展皱纹功效。","能有效地促进新陈代谢"),
	玉米("007","玉米","玉米，又称棒子，包米等","是全世界总产量最高的粮食作物。","在所有主食中，玉米的营养价值和保健作用是最高的。","营养价值和保健作用非常高"),
	蘑菇("008","蘑菇","蘑菇，又名肉菌","蘑菇的子实体在成熟时很象一把撑开的小伞，有药食作用。","具镇痛、镇静功效；可增强T淋巴细胞功能，提高机体抵御各种疾病的免疫功能。","能提高抵御疾病的免疫能力"),
	豆角("009","豆角","豆角，又名豇豆","豆荚长而像管状，质脆而身软，常见有白豆角和青豆角两种。","豆类蔬菜的共性是性平、有化湿补脾的功效，对脾胃虚弱的人尤其适合。","有化湿补脾的功效"),
	土豆("010","土豆","土豆，又名马铃薯","重要的粮食、蔬菜兼用作物。","富含柔软的膳食纤维，容易产生饱腹感，它只含0.1%的脂肪，是所有充饥食物中脂肪含量最低的。","是所有充饥食物中脂肪含量最低的"),
	青椒("011","青椒","青椒，又名柿子椒","果实较大，辣味较淡甚至根本不辣，有红、黄、紫等多种颜色，被广泛用于配菜。","辣椒所含的辣椒素，能够促进脂肪的新陈代谢，防止体内脂肪积存，有利于降脂减肥哦！","能防止脂肪积存，有利于减肥"),
	菜花("012","菜花","菜花，又名花椰菜","粗纤维含量少，品质鲜嫩，营养丰富，风味鲜美。","最好的血管清理剂，能够阻止胆固醇氧化，防止血小板凝结成块，因而减少心脏病与中风的危险。","能减少心脏病与中风的危险"),
	芹菜("013","芹菜","芹菜，又名香芹","高纤维食物,它经肠内消化作用产生抗氧化剂。","常吃芹菜,尤其是吃芹菜叶,对预防高血压、动脉硬化等都十分有益；绿色减肥食品。","能预防高血压、动脉硬化等"),
	尖椒("014","尖椒","尖椒，辣椒","辣椒在许多地区都是非常重要的调味品，甚至没有它就无法下饭。","含有丰富的维生素 C，和抗氧化物质，抗衰老，能加速新陈代谢以达到燃烧体内脂肪的效果。","能加速新陈代谢，燃烧脂肪"),
	卷心菜("015","卷心菜","卷心菜，又名洋白菜，大头菜","卷心菜在外国的地位很高，犹如白菜之在中国。这就是“洋白菜”这一名称的由来吧。","含有某种“溃疡愈合因子”，对溃疡有着很好的治疗作用，能加速创面愈合；可增进食欲。","能加速创面愈合，增进食欲"),
	洋葱("016","洋葱","洋葱，又名圆葱，葱头等","肉质柔嫩，汁多辣味淡，品质佳，适于生食。","含有抗癌的化学物质，洋葱吃得越多，得胃癌的机率就越低；洋葱可以使哮喘的发作机率降低一半左右。","可以使哮喘的发作机率降低一半"),
	白菜("017","白菜","白菜，俗称大白菜","味道鲜美可口，营养丰富，素有“菜中之王”的美称。","白菜性味甘平，有清热除烦、解渴利尿、通利肠胃的功效，经常吃白菜可防止维生素C缺乏症。","可以清热除烦、解渴利尿、通利肠胃"),
	大葱("018","大葱","大葱","在菜肴中应用较广，可作辅料可当作调味品。","能祛除腥膻等油腻厚味菜肴中的异味，产生特殊香气，并有较强的杀菌作用，可以刺激消化液的分泌，增进食欲。","可以刺激消化液分泌，增进食欲"),
	我神马都不喜欢("019","我神马都不喜欢","我神马都不喜欢","非食草动物，亦可能非杂食动物，很可能是纯食肉动物！","讨厌一切蔬菜，活到今天是个奇迹",""),
	我神马都很喜欢("020","我神马都很喜欢","我神马都很喜欢","食草动物，亦可能杂食动物，非纯食肉动物！","喜欢蔬菜，身体好好",""),
	香菜("021","香菜","香菜","能促进胃肠蠕动，具有开胃醒脾的作用。","含有许多挥发油，散发特殊香气，常用作提味佳疏。","能促进胃肠蠕动，开胃醒脾"),
	菠菜("022","菠菜","菠菜","富含铁，令人面色红润，养颜佳品。","大力水手的菠菜！","可以让人面色红润，是养颜佳品"),
	苦瓜("023","苦瓜","苦瓜，又名凉瓜","解疲乏，清心聪耳明目，润泽肌肤，使人精力旺盛，不易衰老。","苦瓜虽苦，却从不会把苦味传给“别人”，有“君子菜”的雅称。","可以使人精力旺盛，不易衰老"),
	韭菜("024","韭菜","韭菜","具健胃、提神、止汗固涩、补肾助阳、固精等功效。","韭菜有一个很响亮的名字叫“壮阳草”。","可以健胃提神、止汗固涩、补肾助阳"),
	冬瓜("025","冬瓜","冬瓜","其化学成分有显著的生理活性，有减肥和美容效果！","蔬菜淡季的重要调节品种。","有减肥和美容效果"),
	蒜苔("026","蒜苔","蒜苔","抑制人体内多种细菌的生长繁殖。","含有丰富的大蒜素，大蒜新素。","可以抑制人体内多种细菌的生长繁殖"),
	;
				
	private final String vid;			//序号
	private final String name;			//中文名
	private final String names;			//名字+别名
	private final String techang;		//特长
	private final String aihao;			//爱好
	private final String demo;			//简述
	
	private VegetableEnum(String vid, String name, String names, String techang, String aihao, String demo) {
		this.vid = vid;
		this.name = name;
		this.names = names;
		this.techang = techang;
		this.aihao = aihao;
		this.demo = demo;
	}
	public String getVid() {
		return vid;
	}
	public String getName() {
		return name;
	}
	public String getTechang() {
		return techang;
	}
	public String getAihao() {
		return aihao;
	}
	public String getDemo() {
		return demo;
	}
	public String getNames() {
		return names;
	}

	public static void main(String[] args) {
		
	}
}
